In [5]:
import pandas as pd
import numpy as np

In [14]:
np.random.seed(123)
df = pd.DataFrame(dict(근속년수 = [1, 2, 3] * 10,
                       연봉 = np.random.randint(100, 500, size = 30)))
df.iloc[0, 1] = 1200
df.head(2)

   근속년수    연봉
0     1  1200
1     2   482

In [17]:
df_agg = df.groupby("근속년수")["연봉"].agg(["mean", "std"]).reset_index()
df_agg["out_l"] = df_agg["mean"] - 2 * df_agg["std"] 
df_agg["out_u"] = df_agg["mean"] + 2 * df_agg["std"] 
df_agg

   근속년수   mean         std       out_l       out_u
0     1  355.8  314.209343 -272.618686  984.218686
1     2  255.2  112.566820   30.066361  480.333639
2     3  292.5  128.593459   35.313081  549.686919

In [20]:
df_join = df.merge(df_agg.drop(columns = ["mean", "std"]), 
                   on = "근속년수")
df_join.head()

   근속년수    연봉       out_l       out_u
0     1  1200 -272.618686  984.218686
1     1   198 -272.618686  984.218686
2     1   183 -272.618686  984.218686
3     1   157 -272.618686  984.218686
4     1   196 -272.618686  984.218686

In [21]:
condi_1 = df_join["연봉"] >= df_join["out_l"]
condi_2 = df_join["연봉"] <= df_join["out_u"]
df_join_in = df_join.loc[condi_1 & condi_2, ]

In [22]:
len(df_join), len(df_join_in)

(30, 28)